package sample;

public class Экран_аккаунта {
    private Контроллер_аккаунта контроллер_аккаунта;
    private Контроллер_заказов контроллер_заказов;

    public void Показать_информацию(Контроллер_аккаунта контроллер_аккаунта) {};
    public void Показать_историю(Контроллер_аккаунта контроллер_аккаунта) {};
    public void Обновить_информацию_окна() {};
    public void Привязать_карту_к_аккаунту(Контроллер_аккаунта контроллер_аккаунта) {};
    public void Создание_заказа(Контроллер_заказов контроллер_заказов) {};
    public void Просмотр_истории(Контроллер_аккаунта контроллер_аккаунта) {};
    public void Показать_окно() {};
    public void Удаление_заказа(Контроллер_заказов контроллер_заказов) {};
    public void Поиск() {};
}
